InformationRegisters/НастройкиПоказателейЗУП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПоказателейЗУП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПоказательЗУП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПоказателиЗУП</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФормаУчастия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТрудовыеРоли</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПараметра</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПараметровРасчетаНачислений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПоказательРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПоказателиРасчетаНачислений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗначениеПараметра</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииВыработки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыПараметровРасчетаНачислений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыПараметровРасчетаНачислений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Число</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КатегорияВыработки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОценкаПоПрейскуранту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВсеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВсеТовары</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДанныеТабеля</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Шкала</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВидНачисления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВсеНачисления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Филиал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ответственный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительныйПараметр</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ПоказателиРасчетаНачислений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ПоказателиРасчетаНачислений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Сумма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Количество</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Себестоимость</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СуммаБезСкидок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Параметр1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Параметр2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Параметр3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СуммаОплат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтоимостьПоПрайсу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоДнейПоТабелю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоЧасовПоТабелю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СуммаПродажУслуг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СуммаПродажТоваров</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СуммаПродажАбонементов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДнейПоНорме</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧасовПоНорме</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДнейОтработаноПоНорме</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧасовОтработаноПоНорме</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДнейОтработаноСверхНормы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧасовОтработаноСверхНормы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/НастройкиПоказателейЗУП/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаКлиенте
Процедура ВидРасчетаПриИзменении(Элемент)
	НастроитьСпискиВыбораНаСервере();
КонецПроцедуры

&НаСервере
Процедура НастроитьСпискиВыбораНаСервере()
	
	мсСписокВидовРасчета = Новый Массив;
	Если ЗначениеЗаполнено(Запись.ПоказательЗУП) Тогда
		Если Запись.ПоказательЗУП.ЭтоВидВремени Тогда 
			мсСписокВидовРасчета.Добавить(Перечисления.ВидыПараметровРасчетаНачислений.ДанныеТабеля);	
		Иначе
			мсСписокВидовРасчета.Добавить(Перечисления.ВидыПараметровРасчетаНачислений.КатегорияВыработки);
			мсСписокВидовРасчета.Добавить(Перечисления.ВидыПараметровРасчетаНачислений.ВсеТовары);
			мсСписокВидовРасчета.Добавить(Перечисления.ВидыПараметровРасчетаНачислений.ВсеУслуги);
		КонецЕсли;
	КонецЕсли;
	Элементы.ВидРасчета.СписокВыбора.ЗагрузитьЗначения(мсСписокВидовРасчета);
	
	Масс = Новый Массив;
	Если Запись.ВидПараметра = Перечисления.ВидыПараметровРасчетаНачислений.ДанныеТабеля Тогда
		
		Масс.Добавить(Перечисления.ПоказателиРасчетаНачислений.КоличествоДнейПоТабелю);
		Масс.Добавить(Перечисления.ПоказателиРасчетаНачислений.КоличествоЧасовПоТабелю);
		
	ИначеЕсли Запись.ВидПараметра = Перечисления.ВидыПараметровРасчетаНачислений.КатегорияВыработки Или
		Запись.ВидПараметра = Перечисления.ВидыПараметровРасчетаНачислений.ВсеТовары Или 
		Запись.ВидПараметра = Перечисления.ВидыПараметровРасчетаНачислений.ВсеУслуги Тогда
		
		Масс.Добавить(Перечисления.ПоказателиРасчетаНачислений.Количество);
		Масс.Добавить(Перечисления.ПоказателиРасчетаНачислений.СуммаБезСкидок);
		Масс.Добавить(Перечисления.ПоказателиРасчетаНачислений.Себестоимость);
		Масс.Добавить(Перечисления.ПоказателиРасчетаНачислений.Сумма);
		Масс.Добавить(Перечисления.ПоказателиРасчетаНачислений.СтоимостьПоПрайсу);
		
	КонецЕсли;
	Элементы.ПоказательРасчета.СписокВыбора.ЗагрузитьЗначения(Масс);
	
	Если Запись.ВидПараметра = Перечисления.ВидыПараметровРасчетаНачислений.КатегорияВыработки Тогда
		
		Элементы.ЗначениеПараметра.Доступность = Истина;
		
	Иначе
		
		Элементы.ЗначениеПараметра.Доступность = Ложь;
		Запись.ЗначениеПараметра = Неопределено;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	НастроитьСпискиВыбораНаСервере();
 
КонецПроцедуры

&НаКлиенте
Процедура ПоказательЗУППриИзменении(Элемент)
	НастроитьСпискиВыбораНаСервере();
КонецПроцедуры
